<?xml version="1.0" ?>
<net batch="1" name="model" version="2">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>100</dim>
					<dim>15</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="5" kernel-y="5" output="20" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>15</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>20</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="30000"/>
				<biases offset="30000" size="80"/>
			</blobs>
		</layer>
		<layer id="2" name="pool1" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel-x="2" kernel-y="2" pad-x="0" pad-y="0" pool-method="max" rounding_type="ceil" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>20</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>20</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv2" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="5" kernel-y="5" output="50" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>20</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>50</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="30080" size="100000"/>
				<biases offset="130080" size="200"/>
			</blobs>
		</layer>
		<layer id="4" name="pool2" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel-x="2" kernel-y="2" pad-x="0" pad-y="0" pool-method="max" rounding_type="ceil" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>50</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>50</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="ip1" precision="FP32" type="FullyConnected">
			<data out-size="500"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>50</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>500</dim>
				</port>
			</output>
			<blobs>
				<weights offset="130280" size="14400000"/>
				<biases offset="14530280" size="2000"/>
			</blobs>
		</layer>
		<layer id="6" name="relu1" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>500</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="ip2" precision="FP32" type="FullyConnected">
			<data out-size="2"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>500</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="14532280" size="4000"/>
				<biases offset="14536280" size="8"/>
			</blobs>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
	</edges>
</net>
